class Solution {
public:
    /******************************************************************************/
    /*  Determine whether an integer is a palindrome. Do this without extra space.
    /******************************************************************************/
    
    /******************************************************************************/
    /*  思路：提取原数的后半部分，与前半部分对比，同样要注意奇偶的问题
    /******************************************************************************/
    bool isPalindrome(int x) {
        // 如果是负数或者是10的倍数，直接返回false
        if(x < 0 || (x != 0 && x % 10 == 0)) return false;
        
        int sum = 0;
        while(x > sum) {
            sum = sum * 10 + x % 10;
            x = x / 10;
        }
        return (x == sum) || (x == sum / 10);
    }
};