class Solution {
public:
    
    /*************************************************************/
    /*  Reverse bits of a given 32 bits unsigned integer.
    /*  For example, given input 43261596 (represented in binary as 
    /*  00000010100101000001111010011100), return 964176192 
    /*  (represented in binary as 00111001011110000010100101000000).
    /*************************************************************/
    
    /*************************************************************/
    /*  思路：
    /*  1）取原数据的最低位，加到m
    /*  2）右移原数，左移m
    /*  3）注意m左移和异或的先后顺序
    /*************************************************************/
    uint32_t reverseBits(uint32_t n) {
        uint32_t m = 0;
        for (int i = 0; i < 32; i++) {
            m <<= 1;
            m |= (n & 1);
            n >>= 1;
        }
        return m;
    }
};